src/cfe/КСП/ChartsOfCharacteristicTypes/КСП_НастройкиRetailCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>КСП_НастройкиRetailCRM</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
				<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
				<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>500</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_ЗначенияНастроекRetailCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ЗначенияНастроекRetailCRM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.КСП_НастройкиRetailCRM</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КСП_НастройкиRetailCRM</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/ChartsOfCharacteristicTypes/КСП_НастройкиRetailCRM/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	Значение = Неопределено;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Значение <> ЗначениеДоИзменения Тогда
		МенЗап = РегистрыСведений.ксп_ЗначенияНастроекRetailCRM.СоздатьМенеджерЗаписи();
		МенЗап.Настройка 	= ТекущийОбъект.Ссылка;
		МенЗап.Значение		= Значение;
		МенЗап.Записать();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МенЗап = РегистрыСведений.ксп_ЗначенияНастроекRetailCRM.СоздатьМенеджерЗаписи();
	МенЗап.Настройка 	= ТекущийОбъект.Ссылка;
	МенЗап.Прочитать();
	Если МенЗап.Выбран() Тогда
		Значение 			= МенЗап.Значение;
		ЗначениеДоИзменения = МенЗап.Значение;
	КонецЕсли;
	
КонецПроцедуры
